<?php

//■ 起動
// -----------------------------------------------------------------------------
		require_once('xdef.admin.inc');
		// fcn_basic_auth();
		$con = fcn_db_connect();
// -----------------------------------------------------------------------------


//■ ユーザ登録の実行
// -----------------------------------------------------------------------------
		if(isset($_POST[btn_user_confirm])){
			$Post	=	fcn_user_entry ($con,$_POST);
			header('Location: '.$PHP_SELF.'?mode=list');
		}
// -----------------------------------------------------------------------------


//■ ユーザ登録情報の受け取り
// -----------------------------------------------------------------------------
		if(isset($_POST[btn_user_entry])){
			$Post	=	fcn_clean_array ($_POST,'sjis_print');
	
			if(isset($_POST[Priv])){
				$priv	= implode('/',$_POST['Priv']);
			}else{
				$priv = 'NULL';
			}
		}
// -----------------------------------------------------------------------------


// アクセス制限
// -----------------------------------------------------------------------------
		if(!isset($_COOKIE[cfms_admin2]))	error('不正なアクセスです。','close');

		if(isset($_POST[flag])){
			$fcn = trim($_POST[flag]);
		}else{
			error('不適切なアクセスです。','close');
		}
// -----------------------------------------------------------------------------


//■ 画面出力
// -----------------------------------------------------------------------------
		// ターゲットIDの設定
		if($fcn =='edit')	$tid = trim($_POST['tid']);

		fcn_header_admin ('ユーザ登録の確認');
		include_once('admin.tab.user.3.php');
		spacer(30);
		include_once('admin.form.user.confirm.php');
// -----------------------------------------------------------------------------


?>